In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report,confusion_matrix,accuracy_score

In [2]:
df = pd.read_csv('train.csv')
df2 = pd.read_csv('test.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [6]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [7]:
df['Sex'] = df['Sex'].replace({'male':1,'female':0})
df['Embarked'] = df['Embarked'].replace({'S':1,'C':2,'Q':3})
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,1.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,2.0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,1.0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",1,27.0,0,0,211536,13.0000,NaN,1.0
887,888,1,1,"Graham, Miss. Margaret Edith",0,19.0,0,0,112053,30.0000,B42,1.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,1,2,W./C. 6607,23.4500,NaN,1.0
889,890,1,1,"Behr, Mr. Karl Howell",1,26.0,0,0,111369,30.0000,C148,2.0
890,891,0,3,"Dooley, Mr. Patrick",1,32.0,0,0,370376,7.7500,NaN,3.0

In [8]:
df2['Sex'] = df2['Sex'].replace({'male':1,'female':0})
df2['Embarked'] = df2['Embarked'].replace({'S':1,'C':2,'Q':3})
df2

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,3
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,1
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,3
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",1,NaN,0,0,A.5. 3236,8.0500,NaN,1
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,108.9000,C105,2
415,1307,3,"Saether, Mr. Simon Sivertsen",1,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,1
416,1308,3,"Ware, Mr. Frederick",1,NaN,0,0,359309,8.0500,NaN,1
417,1309,3,"Peter, Master. Michael J",1,NaN,1,1,2668,22.3583,NaN,2

In [11]:
df['Age'].median()

28.0

In [12]:
df['Age'] = df['Age'].fillna(28.0)
df2['Age'] = df2['Age'].fillna(28.0)

In [13]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
df.drop(columns=['Cabin','Name','Ticket'],inplace=True)

In [15]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       2
dtype: int64

In [16]:
df.dropna(inplace=True)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Sex          889 non-null    int64
 4   Age          889 non-null    float64
 5   SibSp        889 non-null    int64
 6   Parch        889 non-null    int64
 7   Fare         889 non-null    float64
 8   Embarked     889 non-null    float64
dtypes: float64(3), int64(6)
memory usage: 69.5 KB

In [18]:
df['Embarked'] = df['Embarked'].astype('int64')
df2['Embarked'] = df2['Embarked'].astype('int64')

In [19]:
df.describe()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
count,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000,889.000000
mean,446.000000,0.382452,2.311586,0.649044,29.315152,0.524184,0.382452,32.096681,1.362205
std,256.998173,0.486260,0.834700,0.477538,12.984932,1.103705,0.806761,49.697504,0.636157
min,1.000000,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,1.000000
25%,224.000000,0.000000,2.000000,0.000000,22.000000,0.000000,0.000000,7.895800,1.000000
50%,446.000000,0.000000,3.000000,1.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,668.000000,1.000000,3.000000,1.000000,35.000000,1.000000,0.000000,31.000000,2.000000
max,891.000000,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,3.000000

In [20]:
df['Survived_'] = df['Survived'].astype('Bool')
df['Pclass_'] = df['Pclass'].astype('category')
df['Sex_'] = df['Sex'].astype('category')
df['Embarked_'] = df['Embarked'].astype('category')

In [29]:
df2['Pclass_'] = df2['Pclass'].astype('category')
df2['Sex_'] = df2['Sex'].astype('category')
df2['Embarked_'] = df2['Embarked'].astype('category')

In [21]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived_,Pclass_,Sex_,Embarked_
0,1,0,3,1,22.0,1,0,7.2500,1,False,3,1,1
1,2,1,1,0,38.0,1,0,71.2833,2,True,1,0,2
2,3,1,3,0,26.0,0,0,7.9250,1,True,3,0,1
3,4,1,1,0,35.0,1,0,53.1000,1,True,1,0,1
4,5,0,3,1,35.0,0,0,8.0500,1,False,3,1,1

In [24]:
Age_group = [0,22,28,35,50,100]
Age_label = [1,2,3,4,5]
df['Age_'] = pd.cut(df['Age'],bins=Age_group,labels=Age_label)
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived_,Pclass_,Sex_,Embarked_,Age_
0,1,0,3,1,22.0,1,0,7.2500,1,False,3,1,1,1
1,2,1,1,0,38.0,1,0,71.2833,2,True,1,0,2,4
2,3,1,3,0,26.0,0,0,7.9250,1,True,3,0,1,2
3,4,1,1,0,35.0,1,0,53.1000,1,True,1,0,1,3
4,5,0,3,1,35.0,0,0,8.0500,1,False,3,1,1,3

In [31]:
Age_group = [0,22,28,35,50,100]
Age_label = [1,2,3,4,5]
df2['Age_'] = pd.cut(df['Age'],bins=Age_group,labels=Age_label)
df2.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_,Sex_,Embarked_,Age_
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,3,3,1,3,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,1,3,0,1,4
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,3,2,1,3,2
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,1,3,1,1,3
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,1,3,0,1,3

In [32]:
df2.drop(columns=['Cabin','Name','Ticket'],inplace=True)

In [33]:
df2.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Pclass_,Sex_,Embarked_,Age_
0,892,3,1,34.5,0,0,7.8292,3,3,1,3,1
1,893,3,0,47.0,1,0,7.0000,1,3,0,1,4
2,894,2,1,62.0,0,0,9.6875,3,2,1,3,2
3,895,3,1,27.0,0,0,8.6625,1,3,1,1,3
4,896,3,0,22.0,1,1,12.2875,1,3,0,1,3

In [43]:
Fare_group = [-1,8,15,30,100,200,550]
Fare_label = [1,2,3,4,5,6]
df['Fare_'] = pd.cut(df['Fare'],bins=Fare_group,labels=Fare_label)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Sex          889 non-null    int64
 4   Age          889 non-null    float64
 5   SibSp        889 non-null    int64
 6   Parch        889 non-null    int64
 7   Fare         889 non-null    float64
 8   Embarked     889 non-null    int64
 9   Survived_    889 non-null    bool
 10  Pclass_      889 non-null    category
 11  Sex_         889 non-null    category
 12  Embarked_    889 non-null    category
 13  Age_         889 non-null    category
 14  Fare_        889 non-null    category
dtypes: bool(1), category(5), float64(2), int64(7)
memory usage: 115.4 KB

In [44]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived_,Pclass_,Sex_,Embarked_,Age_,Fare_
0,1,0,3,1,22.0,1,0,7.2500,1,False,3,1,1,1,1
1,2,1,1,0,38.0,1,0,71.2833,2,True,1,0,2,4,4
2,3,1,3,0,26.0,0,0,7.9250,1,True,3,0,1,2,1
3,4,1,1,0,35.0,1,0,53.1000,1,True,1,0,1,3,4
4,5,0,3,1,35.0,0,0,8.0500,1,False,3,1,1,3,2

In [45]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
Survived_      0
Pclass_        0
Sex_           0
Embarked_      0
Age_           0
Fare_          0
dtype: int64

In [190]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import cross_val_score
from sklearn import model_selection

In [176]:
#feature = ['Pclass_','Sex_','Age_','SibSp','Parch','Embarked','Fare_']
feature = ['Pclass_','Sex_','Age_','SibSp','Parch','Embarked','Fare_']
X = df[feature]
y = df['Survived']

In [177]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.25)

In [192]:
kfold = model_selection.KFold(n_splits=5,random_state=1)

In [193]:
model = DecisionTreeClassifier()
cvs = model_selection.cross_val_score(model,X_train,y_train,cv=kfold)
#cvs = cross_val_score(model,X_train,y_train,cv=5)
cvs

array([0.81343284, 0.72932331, 0.78195489, 0.79699248, 0.83458647])

In [194]:
cvs.mean()

0.7912579957356077

In [195]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [196]:
y_pred = model.predict(X_test)

In [197]:
print(classification_report(y_test,y_pred,target_names=['Dead','Survived']))

              precision    recall  f1-score   support

        Dead       0.83      0.85      0.84       144
    Survived       0.72      0.67      0.69        79

    accuracy                           0.79       223
   macro avg       0.77      0.76      0.77       223
weighted avg       0.79      0.79      0.79       223

In [198]:
from sklearn.naive_bayes import GaussianNB

In [199]:
model2 = GaussianNB()
cvs2 = model_selection.cross_val_score(model2,X_train,y_train,cv=kfold)
#cvs2 = cross_val_score(model2,X_train,y_train,cv=5)
cvs2

array([0.7761194 , 0.7443609 , 0.79699248, 0.81203008, 0.7518797 ])

In [200]:
cvs2.mean()

0.7762765121759623

In [201]:
model2.fit(X_train,y_train)

GaussianNB()

In [202]:
y_pred2 = model2.predict(X_test)

In [203]:
print(classification_report(y_test,y_pred2,target_names=['Dead','Survived']))

              precision    recall  f1-score   support

        Dead       0.83      0.85      0.84       144
    Survived       0.72      0.67      0.69        79

    accuracy                           0.79       223
   macro avg       0.77      0.76      0.77       223
weighted avg       0.79      0.79      0.79       223

In [218]:
from sklearn.linear_model import LogisticRegression

In [219]:
model3 = LogisticRegression()
cvs3 = model_selection.cross_val_score(model3,X_train,y_train,cv=kfold)
cvs3

array([0.79850746, 0.77443609, 0.79699248, 0.79699248, 0.78195489])

In [226]:
cvs3.mean()

0.7897766805072383

In [240]:
model3.fit(X_train,y_train)

LogisticRegression()

In [241]:
y_pred3 = model3.predict(X_test)

In [242]:
print(classification_report(y_test,y_pred3,target_names=['Dead','Survived']))

              precision    recall  f1-score   support

        Dead       0.83      0.87      0.85       144
    Survived       0.74      0.67      0.70        79

    accuracy                           0.80       223
   macro avg       0.78      0.77      0.77       223
weighted avg       0.80      0.80      0.80       223

In [220]:
from sklearn.neural_network import MLPClassifier

In [246]:
model4 = MLPClassifier(hidden_layer_sizes=(200,),max_iter=100,alpha=1e-4,solver='sgd',verbose=10,tol=1e-5,random_state=1,learning_rate_init=0.01)
cvs4 = model_selection.cross_val_score(model4,X_train,y_train,cv=kfold)
cvs4

Iteration 1, loss = 0.75974856
Iteration 2, loss = 0.63705440
Iteration 3, loss = 0.63127210
Iteration 4, loss = 0.60744798
Iteration 5, loss = 0.57581694
Iteration 6, loss = 0.56304578
Iteration 7, loss = 0.55694580
Iteration 8, loss = 0.54627353
Iteration 9, loss = 0.53974704
Iteration 10, loss = 0.53410421
Iteration 11, loss = 0.52927174
Iteration 12, loss = 0.52326467
Iteration 13, loss = 0.51854306
Iteration 14, loss = 0.51340431
Iteration 15, loss = 0.50949169
Iteration 16, loss = 0.50494020
Iteration 17, loss = 0.50184786
Iteration 18, loss = 0.49768294
Iteration 19, loss = 0.49497605
Iteration 20, loss = 0.49112462
Iteration 21, loss = 0.48833533
Iteration 22, loss = 0.48607430
Iteration 23, loss = 0.48291966
Iteration 24, loss = 0.48088230
Iteration 25, loss = 0.47833878
Iteration 26, loss = 0.47619925
Iteration 27, loss = 0.47471478
Iteration 28, loss = 0.47226981
Iteration 29, loss = 0.47101127
Iteration 30, loss = 0.46880650
Iteration 31, loss = 0.46757369
Iteration 32, loss = 0.46588076
Iteration 33, loss = 0.46490107
Iteration 34, loss = 0.46321095
Iteration 35, loss = 0.46185605
Iteration 36, loss = 0.46108341
Iteration 37, loss = 0.45988994
Iteration 38, loss = 0.45891841
Iteration 39, loss = 0.45758092
Iteration 40, loss = 0.45686808
Iteration 41, loss = 0.45616969
Iteration 42, loss = 0.45526333
Iteration 43, loss = 0.45534743
Iteration 44, loss = 0.45407396
Iteration 45, loss = 0.45355813
Iteration 46, loss = 0.45241402
Iteration 47, loss = 0.45189143
Iteration 48, loss = 0.45108164
Iteration 49, loss = 0.45106457
Iteration 50, loss = 0.45085670
Iteration 51, loss = 0.44988542
Iteration 52, loss = 0.44946591
Iteration 53, loss = 0.44896840
Iteration 54, loss = 0.44848811
Iteration 55, loss = 0.44815550
Iteration 56, loss = 0.44812298
Iteration 57, loss = 0.44791218
Iteration 58, loss = 0.44801853
Iteration 59, loss = 0.44665880
Iteration 60, loss = 0.44757923
Iteration 61, loss = 0.44613784
Iteration 62, loss = 0.44618535
Iteration 63, loss = 0.44576964
Iteration 64, loss = 0.44518310
Iteration 65, loss = 0.44622021
Iteration 66, loss = 0.44490361
Iteration 67, loss = 0.44570785
Iteration 68, loss = 0.44471664
Iteration 69, loss = 0.44466266
Iteration 70, loss = 0.44377258
Iteration 71, loss = 0.44386670
Iteration 72, loss = 0.44377496
Iteration 73, loss = 0.44326239
Iteration 74, loss = 0.44335622
Iteration 75, loss = 0.44302100
Iteration 76, loss = 0.44274376
Iteration 77, loss = 0.44252996
Iteration 78, loss = 0.44244477
Iteration 79, loss = 0.44224240
Iteration 80, loss = 0.44297343
Iteration 81, loss = 0.44172455
Iteration 82, loss = 0.44150095
Iteration 83, loss = 0.44175377
Iteration 84, loss = 0.44216635
Iteration 85, loss = 0.44242628
Iteration 86, loss = 0.44244788
Iteration 87, loss = 0.44126215
Iteration 88, loss = 0.44072179
Iteration 89, loss = 0.44062041
Iteration 90, loss = 0.44045176
Iteration 91, loss = 0.44096410
Iteration 92, loss = 0.44053792
Iteration 93, loss = 0.44105377
Iteration 94, loss = 0.43985328
Iteration 95, loss = 0.43956414
Iteration 96, loss = 0.44013234
Iteration 97, loss = 0.44008264
Iteration 98, loss = 0.43915703
Iteration 99, loss = 0.43950383
Iteration 100, loss = 0.43932965
Iteration 1, loss = 0.76051866
Iteration 2, loss = 0.63653025
Iteration 3, loss = 0.62473725
Iteration 4, loss = 0.59562304
Iteration 5, loss = 0.56199067
Iteration 6, loss = 0.55068456
Iteration 7, loss = 0.54071197
Iteration 8, loss = 0.52992271
Iteration 9, loss = 0.52199933
Iteration 10, loss = 0.51666903
Iteration 11, loss = 0.51181216
Iteration 12, loss = 0.50589631
Iteration 13, loss = 0.50053645
Iteration 14, loss = 0.49486259
Iteration 15, loss = 0.49025671
Iteration 16, loss = 0.48528629
Iteration 17, loss = 0.48075915
Iteration 18, loss = 0.47680940
Iteration 19, loss = 0.47281550
Iteration 20, loss = 0.46896988
Iteration 21, loss = 0.46604939
Iteration 22, loss = 0.46339257
Iteration 23, loss = 0.46013753
Iteration 24, loss = 0.45707128
Iteration 25, loss = 0.45436098
Iteration 26, loss = 0.45186676
Iteration 27, loss = 0.44990635
Iteration 28, loss = 0.44732038
Iteration 29, loss = 0.44543792
Iteration 30, loss = 0.44424186
Iteration 31, loss = 0.44224514
Iteration 32, loss = 0.44037310
Iteration 33, loss = 0.43847747
Iteration 34, loss = 0.43662292
Iteration 35, loss = 0.43547676
Iteration 36, loss = 0.43421225
Iteration 37, loss = 0.43294376
Iteration 38, loss = 0.43197785
Iteration 39, loss = 0.43071862
Iteration 40, loss = 0.42919384
Iteration 41, loss = 0.42867857
Iteration 42, loss = 0.42741765
Iteration 43, loss = 0.42689178
Iteration 44, loss = 0.42561031
Iteration 45, loss = 0.42513328
Iteration 46, loss = 0.42398303
Iteration 47, loss = 0.42337335
Iteration 48, loss = 0.42287279
Iteration 49, loss = 0.42291266
Iteration 50, loss = 0.42163124
Iteration 51, loss = 0.42101164
Iteration 52, loss = 0.42051727
Iteration 53, loss = 0.41996530
Iteration 54, loss = 0.41922525
Iteration 55, loss = 0.41926085
Iteration 56, loss = 0.41833643
Iteration 57, loss = 0.41772085
Iteration 58, loss = 0.41770810
Iteration 59, loss = 0.41723045
Iteration 60, loss = 0.41661359
Iteration 61, loss = 0.41604830
Iteration 62, loss = 0.41579887
Iteration 63, loss = 0.41551018
Iteration 64, loss = 0.41609487
Iteration 65, loss = 0.41522146
Iteration 66, loss = 0.41568361
Iteration 67, loss = 0.41429398
Iteration 68, loss = 0.41585889
Iteration 69, loss = 0.41478209
Iteration 70, loss = 0.41306768
Iteration 71, loss = 0.41336158
Iteration 72, loss = 0.41326864
Iteration 73, loss = 0.41236545
Iteration 74, loss = 0.41213127
Iteration 75, loss = 0.41224545
Iteration 76, loss = 0.41172224
Iteration 77, loss = 0.41173539
Iteration 78, loss = 0.41098453
Iteration 79, loss = 0.41151213
Iteration 80, loss = 0.41083580
Iteration 81, loss = 0.41045013
Iteration 82, loss = 0.41033191
Iteration 83, loss = 0.40994032
Iteration 84, loss = 0.40982171
Iteration 85, loss = 0.41087817
Iteration 86, loss = 0.41113430
Iteration 87, loss = 0.40904909
Iteration 88, loss = 0.40899848
Iteration 89, loss = 0.40939940
Iteration 90, loss = 0.40874283
Iteration 91, loss = 0.40825221
Iteration 92, loss = 0.40811384
Iteration 93, loss = 0.40882854
Iteration 94, loss = 0.40829665
Iteration 95, loss = 0.40766736
Iteration 96, loss = 0.40762573
Iteration 97, loss = 0.40696253
Iteration 98, loss = 0.40689196
Iteration 99, loss = 0.40650804
Iteration 100, loss = 0.40633400
Iteration 1, loss = 0.76817857
Iteration 2, loss = 0.64950918
Iteration 3, loss = 0.63121182
Iteration 4, loss = 0.60799504
Iteration 5, loss = 0.58035850
Iteration 6, loss = 0.57226612
Iteration 7, loss = 0.56239269
Iteration 8, loss = 0.55429498
Iteration 9, loss = 0.54850625
Iteration 10, loss = 0.54269512
Iteration 11, loss = 0.53922111
Iteration 12, loss = 0.53352946
Iteration 13, loss = 0.52848498
Iteration 14, loss = 0.52375569
Iteration 15, loss = 0.52127615
Iteration 16, loss = 0.51527554
Iteration 17, loss = 0.51121356
Iteration 18, loss = 0.50837145
Iteration 19, loss = 0.50470289
Iteration 20, loss = 0.50156465
Iteration 21, loss = 0.49870268
Iteration 22, loss = 0.49650398
Iteration 23, loss = 0.49382299
Iteration 24, loss = 0.49150717
Iteration 25, loss = 0.48881733
Iteration 26, loss = 0.48641225
Iteration 27, loss = 0.48473379
Iteration 28, loss = 0.48226478
Iteration 29, loss = 0.48125152
Iteration 30, loss = 0.47922849
Iteration 31, loss = 0.47778584
Iteration 32, loss = 0.47603014
Iteration 33, loss = 0.47460282
Iteration 34, loss = 0.47294460
Iteration 35, loss = 0.47204718
Iteration 36, loss = 0.47158866
Iteration 37, loss = 0.47017793
Iteration 38, loss = 0.46876830
Iteration 39, loss = 0.46774428
Iteration 40, loss = 0.46679170
Iteration 41, loss = 0.46597816
Iteration 42, loss = 0.46501913
Iteration 43, loss = 0.46414565
Iteration 44, loss = 0.46321944
Iteration 45, loss = 0.46276821
Iteration 46, loss = 0.46221031
Iteration 47, loss = 0.46255474
Iteration 48, loss = 0.46097481
Iteration 49, loss = 0.46112290
Iteration 50, loss = 0.45953707
Iteration 51, loss = 0.45949246
Iteration 52, loss = 0.45848507
Iteration 53, loss = 0.45815847
Iteration 54, loss = 0.45776861
Iteration 55, loss = 0.45740920
Iteration 56, loss = 0.45728514
Iteration 57, loss = 0.45668437
Iteration 58, loss = 0.45667545
Iteration 59, loss = 0.45568178
Iteration 60, loss = 0.45539525
Iteration 61, loss = 0.45524702
Iteration 62, loss = 0.45507407
Iteration 63, loss = 0.45452736
Iteration 64, loss = 0.45459806
Iteration 65, loss = 0.45465476
Iteration 66, loss = 0.45407935
Iteration 67, loss = 0.45350908
Iteration 68, loss = 0.45453097
Iteration 69, loss = 0.45377555
Iteration 70, loss = 0.45262235
Iteration 71, loss = 0.45301455
Iteration 72, loss = 0.45304573
Iteration 73, loss = 0.45191201
Iteration 74, loss = 0.45170982
Iteration 75, loss = 0.45234301
Iteration 76, loss = 0.45151619
Iteration 77, loss = 0.45114520
Iteration 78, loss = 0.45102410
Iteration 79, loss = 0.45142171
Iteration 80, loss = 0.45045953
Iteration 81, loss = 0.45051881
Iteration 82, loss = 0.45012716
Iteration 83, loss = 0.44994195
Iteration 84, loss = 0.45064611
Iteration 85, loss = 0.45029814
Iteration 86, loss = 0.45027717
Iteration 87, loss = 0.44941083
Iteration 88, loss = 0.44908145
Iteration 89, loss = 0.45057503
Iteration 90, loss = 0.44943025
Iteration 91, loss = 0.44858490
Iteration 92, loss = 0.44868648
Iteration 93, loss = 0.44898627
Iteration 94, loss = 0.44875634
Iteration 95, loss = 0.44802892
Iteration 96, loss = 0.44770359
Iteration 97, loss = 0.44773393
Iteration 98, loss = 0.44778596
Iteration 99, loss = 0.44731743
Iteration 100, loss = 0.44710985
Iteration 1, loss = 0.77286328
Iteration 2, loss = 0.64218978
Iteration 3, loss = 0.62963179
Iteration 4, loss = 0.60436974
Iteration 5, loss = 0.57575533
Iteration 6, loss = 0.56631928
Iteration 7, loss = 0.55626866
Iteration 8, loss = 0.54817064
Iteration 9, loss = 0.54330499
Iteration 10, loss = 0.53709659
Iteration 11, loss = 0.53387304
Iteration 12, loss = 0.52786722
Iteration 13, loss = 0.52355231
Iteration 14, loss = 0.51844039
Iteration 15, loss = 0.51594932
Iteration 16, loss = 0.51033805
Iteration 17, loss = 0.50624501
Iteration 18, loss = 0.50302500
Iteration 19, loss = 0.49957417
Iteration 20, loss = 0.49657737
Iteration 21, loss = 0.49336313
Iteration 22, loss = 0.49157179
Iteration 23, loss = 0.48846333
Iteration 24, loss = 0.48602971
Iteration 25, loss = 0.48333158
Iteration 26, loss = 0.48190124
Iteration 27, loss = 0.47888429
Iteration 28, loss = 0.47725495
Iteration 29, loss = 0.47512132
Iteration 30, loss = 0.47419592
Iteration 31, loss = 0.47161480
Iteration 32, loss = 0.47018207
Iteration 33, loss = 0.46900179
Iteration 34, loss = 0.46720964
Iteration 35, loss = 0.46614239
Iteration 36, loss = 0.46583565
Iteration 37, loss = 0.46593219
Iteration 38, loss = 0.46305335
Iteration 39, loss = 0.46203268
Iteration 40, loss = 0.46096949
Iteration 41, loss = 0.46009350
Iteration 42, loss = 0.45953947
Iteration 43, loss = 0.45855973
Iteration 44, loss = 0.45842680
Iteration 45, loss = 0.45765128
Iteration 46, loss = 0.45656319
Iteration 47, loss = 0.45650338
Iteration 48, loss = 0.45569350
Iteration 49, loss = 0.45516847
Iteration 50, loss = 0.45474971
Iteration 51, loss = 0.45426783
Iteration 52, loss = 0.45363242
Iteration 53, loss = 0.45334939
Iteration 54, loss = 0.45286864
Iteration 55, loss = 0.45259114
Iteration 56, loss = 0.45304087
Iteration 57, loss = 0.45199162
Iteration 58, loss = 0.45203710
Iteration 59, loss = 0.45120362
Iteration 60, loss = 0.45079571
Iteration 61, loss = 0.45041027
Iteration 62, loss = 0.45045374
Iteration 63, loss = 0.44992201
Iteration 64, loss = 0.44967371
Iteration 65, loss = 0.45028346
Iteration 66, loss = 0.44922095
Iteration 67, loss = 0.44894081
Iteration 68, loss = 0.44911096
Iteration 69, loss = 0.44864412
Iteration 70, loss = 0.44818824
Iteration 71, loss = 0.44890595
Iteration 72, loss = 0.44871105
Iteration 73, loss = 0.44736723
Iteration 74, loss = 0.44722940
Iteration 75, loss = 0.44744606
Iteration 76, loss = 0.44675868
Iteration 77, loss = 0.44665407
Iteration 78, loss = 0.44641278
Iteration 79, loss = 0.44660941
Iteration 80, loss = 0.44608388
Iteration 81, loss = 0.44587413
Iteration 82, loss = 0.44569915
Iteration 83, loss = 0.44552748
Iteration 84, loss = 0.44688562
Iteration 85, loss = 0.44537802
Iteration 86, loss = 0.44657257
Iteration 87, loss = 0.44597241
Iteration 88, loss = 0.44480263
Iteration 89, loss = 0.44590496
Iteration 90, loss = 0.44535374
Iteration 91, loss = 0.44410034
Iteration 92, loss = 0.44469846
Iteration 93, loss = 0.44389437
Iteration 94, loss = 0.44475816
Iteration 95, loss = 0.44353796
Iteration 96, loss = 0.44359055
Iteration 97, loss = 0.44348048
Iteration 98, loss = 0.44364006
Iteration 99, loss = 0.44302960
Iteration 100, loss = 0.44265472
Iteration 1, loss = 0.76071660
Iteration 2, loss = 0.64837858
Iteration 3, loss = 0.63462895
Iteration 4, loss = 0.60859319
Iteration 5, loss = 0.58105701
Iteration 6, loss = 0.57363546
Iteration 7, loss = 0.56270810
Iteration 8, loss = 0.55319898
Iteration 9, loss = 0.54801244
Iteration 10, loss = 0.54175545
Iteration 11, loss = 0.53726160
Iteration 12, loss = 0.53040218
Iteration 13, loss = 0.52558210
Iteration 14, loss = 0.52038558
Iteration 15, loss = 0.51657284
Iteration 16, loss = 0.51166452
Iteration 17, loss = 0.50783320
Iteration 18, loss = 0.50398191
Iteration 19, loss = 0.50062420
Iteration 20, loss = 0.49769981
Iteration 21, loss = 0.49410688
Iteration 22, loss = 0.49144944
Iteration 23, loss = 0.48863589
Iteration 24, loss = 0.48571434
Iteration 25, loss = 0.48304016
Iteration 26, loss = 0.48248578
Iteration 27, loss = 0.47904281
Iteration 28, loss = 0.47675789
Iteration 29, loss = 0.47487746
Iteration 30, loss = 0.47358521
Iteration 31, loss = 0.47140625
Iteration 32, loss = 0.46979428
Iteration 33, loss = 0.46958158
Iteration 34, loss = 0.46677308
Iteration 35, loss = 0.46580564
Iteration 36, loss = 0.46599531
Iteration 37, loss = 0.46452508
Iteration 38, loss = 0.46254618
Iteration 39, loss = 0.46133352
Iteration 40, loss = 0.46081475
Iteration 41, loss = 0.45979416
Iteration 42, loss = 0.46000810
Iteration 43, loss = 0.45832494
Iteration 44, loss = 0.45753934
Iteration 45, loss = 0.45663413
Iteration 46, loss = 0.45606500
Iteration 47, loss = 0.45526547
Iteration 48, loss = 0.45501157
Iteration 49, loss = 0.45465722
Iteration 50, loss = 0.45375244
Iteration 51, loss = 0.45327386
Iteration 52, loss = 0.45260942
Iteration 53, loss = 0.45231206
Iteration 54, loss = 0.45182162
Iteration 55, loss = 0.45213438
Iteration 56, loss = 0.45127570
Iteration 57, loss = 0.45073586
Iteration 58, loss = 0.45035274
Iteration 59, loss = 0.45101774
Iteration 60, loss = 0.44958330
Iteration 61, loss = 0.44947299
Iteration 62, loss = 0.44942401
Iteration 63, loss = 0.44981452
Iteration 64, loss = 0.44942026
Iteration 65, loss = 0.44840959
Iteration 66, loss = 0.44805302
Iteration 67, loss = 0.44778239
Iteration 68, loss = 0.44787798
Iteration 69, loss = 0.44677563
Iteration 70, loss = 0.44691124
Iteration 71, loss = 0.44715700
Iteration 72, loss = 0.44625403
Iteration 73, loss = 0.44607073
Iteration 74, loss = 0.44575048
Iteration 75, loss = 0.44584841
Iteration 76, loss = 0.44532022
Iteration 77, loss = 0.44503756
Iteration 78, loss = 0.44536436
Iteration 79, loss = 0.44536945
Iteration 80, loss = 0.44452078
Iteration 81, loss = 0.44391146
Iteration 82, loss = 0.44408399
Iteration 83, loss = 0.44375472
Iteration 84, loss = 0.44396503
Iteration 85, loss = 0.44340707
Iteration 86, loss = 0.44360713
Iteration 87, loss = 0.44369704
Iteration 88, loss = 0.44265697
Iteration 89, loss = 0.44349112
Iteration 90, loss = 0.44273792
Iteration 91, loss = 0.44171241
Iteration 92, loss = 0.44206656
Iteration 93, loss = 0.44146965
Iteration 94, loss = 0.44241392
Iteration 95, loss = 0.44106440
Iteration 96, loss = 0.44118501
Iteration 97, loss = 0.44115195
Iteration 98, loss = 0.44101129
Iteration 99, loss = 0.44045571
Iteration 100, loss = 0.43989244

array([0.79104478, 0.76691729, 0.82706767, 0.78947368, 0.79699248])

In [247]:
cvs4.mean()

0.7942991807877904

In [248]:
model4.fit(X_train,y_train)

Iteration 1, loss = 0.74921704
Iteration 2, loss = 0.62124303
Iteration 3, loss = 0.61467561
Iteration 4, loss = 0.57557104
Iteration 5, loss = 0.56046772
Iteration 6, loss = 0.55021371
Iteration 7, loss = 0.54003708
Iteration 8, loss = 0.53376261
Iteration 9, loss = 0.52783143
Iteration 10, loss = 0.51929560
Iteration 11, loss = 0.51506811
Iteration 12, loss = 0.50857796
Iteration 13, loss = 0.50241751
Iteration 14, loss = 0.49836976
Iteration 15, loss = 0.49358068
Iteration 16, loss = 0.48920134
Iteration 17, loss = 0.48540449
Iteration 18, loss = 0.48280454
Iteration 19, loss = 0.47862206
Iteration 20, loss = 0.47624445
Iteration 21, loss = 0.47379217
Iteration 22, loss = 0.47191920
Iteration 23, loss = 0.46864457
Iteration 24, loss = 0.46815101
Iteration 25, loss = 0.46461837
Iteration 26, loss = 0.46213866
Iteration 27, loss = 0.46149607
Iteration 28, loss = 0.45979926
Iteration 29, loss = 0.45860162
Iteration 30, loss = 0.45793729
Iteration 31, loss = 0.45620091
Iteration 32, loss = 0.45539217
Iteration 33, loss = 0.45532019
Iteration 34, loss = 0.45287312
Iteration 35, loss = 0.45325887
Iteration 36, loss = 0.45298797
Iteration 37, loss = 0.45172005
Iteration 38, loss = 0.44979057
Iteration 39, loss = 0.44920486
Iteration 40, loss = 0.44893955
Iteration 41, loss = 0.44788144
Iteration 42, loss = 0.44891014
Iteration 43, loss = 0.44816195
Iteration 44, loss = 0.44754961
Iteration 45, loss = 0.44745055
Iteration 46, loss = 0.44731164
Iteration 47, loss = 0.44607300
Iteration 48, loss = 0.44522927
Iteration 49, loss = 0.44470032
Iteration 50, loss = 0.44436840
Iteration 51, loss = 0.44418121
Iteration 52, loss = 0.44383429
Iteration 53, loss = 0.44410661
Iteration 54, loss = 0.44336475
Iteration 55, loss = 0.44295337
Iteration 56, loss = 0.44259249
Iteration 57, loss = 0.44225891
Iteration 58, loss = 0.44216719
Iteration 59, loss = 0.44277199
Iteration 60, loss = 0.44186033
Iteration 61, loss = 0.44181016
Iteration 62, loss = 0.44454859
Iteration 63, loss = 0.44203714
Iteration 64, loss = 0.44140715
Iteration 65, loss = 0.44058689
Iteration 66, loss = 0.44107916
Iteration 67, loss = 0.44056294
Iteration 68, loss = 0.43966482
Iteration 69, loss = 0.43934028
Iteration 70, loss = 0.43933325
Iteration 71, loss = 0.43941618
Iteration 72, loss = 0.43967860
Iteration 73, loss = 0.43924132
Iteration 74, loss = 0.43884541
Iteration 75, loss = 0.44010934
Iteration 76, loss = 0.43804952
Iteration 77, loss = 0.43784925
Iteration 78, loss = 0.43835738
Iteration 79, loss = 0.43685808
Iteration 80, loss = 0.43770250
Iteration 81, loss = 0.43797353
Iteration 82, loss = 0.43770115
Iteration 83, loss = 0.43613771
Iteration 84, loss = 0.43634788
Iteration 85, loss = 0.43609669
Iteration 86, loss = 0.43687470
Iteration 87, loss = 0.43964681
Iteration 88, loss = 0.43488113
Iteration 89, loss = 0.43535044
Iteration 90, loss = 0.43520142
Iteration 91, loss = 0.43506006
Iteration 92, loss = 0.43688789
Iteration 93, loss = 0.43440336
Iteration 94, loss = 0.43581360
Iteration 95, loss = 0.43369058
Iteration 96, loss = 0.43622931
Iteration 97, loss = 0.43287354
Iteration 98, loss = 0.43385861
Iteration 99, loss = 0.43368039
Iteration 100, loss = 0.43222533

MLPClassifier(hidden_layer_sizes=(200,), learning_rate_init=0.01, max_iter=100,
              random_state=1, solver='sgd', tol=1e-05, verbose=10)

In [249]:
y_pred4 = model4.predict(X_test)

In [251]:
print(classification_report(y_test,y_pred4,target_names=['Dead','Survived']))

              precision    recall  f1-score   support

        Dead       0.83      0.90      0.86       144
    Survived       0.78      0.66      0.71        79

    accuracy                           0.81       223
   macro avg       0.80      0.78      0.79       223
weighted avg       0.81      0.81      0.81       223

In [252]:
df2.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Pclass_,Sex_,Embarked_,Age_
0,892,3,1,34.5,0,0,7.8292,3,3,1,3,1
1,893,3,0,47.0,1,0,7.0000,1,3,0,1,4
2,894,2,1,62.0,0,0,9.6875,3,2,1,3,2
3,895,3,1,27.0,0,0,8.6625,1,3,1,1,3
4,896,3,0,22.0,1,1,12.2875,1,3,0,1,3

In [254]:
Fare_group = [-1,8,15,30,100,200,550]
Fare_label = [1,2,3,4,5,6]
df2['Fare_'] = pd.cut(df2['Fare'],bins=Fare_group,labels=Fare_label)
df2.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Pclass_,Sex_,Embarked_,Age_,Fare_
0,892,3,1,34.5,0,0,7.8292,3,3,1,3,1,1
1,893,3,0,47.0,1,0,7.0000,1,3,0,1,4,1
2,894,2,1,62.0,0,0,9.6875,3,2,1,3,2,2
3,895,3,1,27.0,0,0,8.6625,1,3,1,1,3,2
4,896,3,0,22.0,1,1,12.2875,1,3,0,1,3,2

In [255]:
feature = ['Pclass_','Sex_','Age_','SibSp','Parch','Embarked','Fare_']
XX = df2[feature]

In [256]:
y_pred5 = model4.predict(XX)

In [257]:
y_pred5

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0],
      dtype=int64)

In [260]:
NK_submission = pd.DataFrame({'PassengerId':df2['PassengerId'],'Survived':y_pred5})
NK_submission.to_csv('submission.csv',index=False)